src/test/resources/xml/valid-message.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header />
	<soapenv:Body>
		<testMessage xmlns="http://www.example.org/schema">
			<number>0</number>
		</testMessage>
	</soapenv:Body>
</soapenv:Envelope>
